95jasmith/EMI-sensor/Building sensor/Code/STM32/EMI_Sensor/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define TX_On_Pin GPIO_PIN_0
#define TX_On_GPIO_Port GPIOA
#define ADCSync_Pin GPIO_PIN_1
#define ADCSync_GPIO_Port GPIOA
#define FPGA_SS_Pin GPIO_PIN_4
#define FPGA_SS_GPIO_Port GPIOA
#define FPGA_CLK_Pin GPIO_PIN_5
#define FPGA_CLK_GPIO_Port GPIOA
#define FPGA_MISO_Pin GPIO_PIN_6
#define FPGA_MISO_GPIO_Port GPIOA
#define FPGA_MOSI_Pin GPIO_PIN_7
#define FPGA_MOSI_GPIO_Port GPIOA
#define FPGA_Config_Pin GPIO_PIN_4
#define FPGA_Config_GPIO_Port GPIOC
#define FPGA_CDone_Pin GPIO_PIN_5
#define FPGA_CDone_GPIO_Port GPIOC
#define dataOut_Tx_Pin GPIO_PIN_6
#define dataOut_Tx_GPIO_Port GPIOC
#define dataOut_Rx_Pin GPIO_PIN_7
#define dataOut_Rx_GPIO_Port GPIOC
#define Tx_C2_Pin GPIO_PIN_8
#define Tx_C2_GPIO_Port GPIOC
#define Tx_C1_Pin GPIO_PIN_8
#define Tx_C1_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
